#include "store.h"
#include "mgame.h"

Pokemon wild_pk[10] = {
		{ "구구", 1 ,100, 100 ,30,"바람일으키기","전광석화" ,16},
		{ "뮤", 1 ,500, 500 ,50,"날려버리기","사이코키네시스" ,151},
		{ "꼬렛", 1 ,100, 100 ,30,"	몸통박치기","필살앞니" ,19},
		{ "아보크", 1 ,300, 300 ,40,"김밥말이","용해액" ,24},
		{ "모래두지", 1 ,100, 100 ,30,"스피드스타","모래뿌리기" ,27},
		{ "주뱃", 1 ,100, 100 ,30,"흡혈","날개치기" ,41},
		{ "디그다", 1 ,100, 100 ,50,"구멍파기","	지진" ,50},
		{ "나옹", 1 ,200, 200 ,40,"물기","베어가르기" ,52},
		{ "고라파덕", 1 ,150, 150 ,40,"할퀴기","하이드로펌프" ,54},
		{ "팬텀", 1 ,300, 300 ,50,"핡기","꿈먹기" ,94},
};

Pokemon Gym_Leader_pk[6] = {
	{ "별가사리", 5 ,200, 200 ,30,"물대포","스피드 스타" ,120},
	{ "아쿠스타", 5 ,500, 500 ,50,"거품광선","냉동빔" ,121},
};

int input_store_choice(int choice)
{
	ps_it = &s_it;
	
	int cony = 38;
	gotoxy(0, cony);
	printf("\n--------------------------------------------------------------------------\n");
	printf("남은 용돈 :%d원\n", gold);
	printf("1.회복약 500원\n2.몬스터볼 500\n3.진화 돌 2000\n4.상점나가기\n");
	scanf("%d", &choice);
	system("cls");

	switch (choice)
	{
	case 1:
		gold -= N_HP;
		if (gold < 0)
		{
			gotoxy(0, cony);
			printf("\n--------------------------------------------------------------------------\n");
			printf("돈이 모자르다\n");
			_sleep(1000);
			system("cls");

			gold += N_HP;
			break;
		}
		else
		{
			gotoxy(0, cony);
			printf("\n--------------------------------------------------------------------------\n");
			printf("회복약을 구매 했다.\n");
			_sleep(1000);
			system("cls");


			(*ps_it).potion.Nomal_potion += 1;
			break;
		}
	case 2:
		gold -= Mb;
		if (gold < 0)
		{
			gotoxy(0, cony);
			printf("\n--------------------------------------------------------------------------\n");
			printf("돈이 모자르다\n");
			_sleep(1000);
			system("cls");


			gold += Mb;
			break;
		}
		else
		{
			gotoxy(0, cony);
			printf("\n--------------------------------------------------------------------------\n");
			printf("몬스터볼을 구매 했다.\n");
			_sleep(1000);
			system("cls");


			(*ps_it).MBall.Mball += 1;
			break;
		}
	case 3:
		gold -= (N_HP + 1500);
		
		if (gold < 0)
		{
			gotoxy(0, cony);
			printf("\n--------------------------------------------------------------------------\n");
			gold += (N_HP + 1500);
			printf("돈이 모자르다\n");
			_sleep(1000);
			system("cls");


			break;
		}
		else
		{
			gotoxy(0, cony);
			printf("\n--------------------------------------------------------------------------\n");
			printf("진화돌 구매 했다.\n");
			_sleep(1000);
			system("cls");

			(*ps_it).SBook.Sbook += 1;
			break;
		}
	case 4:
		gotoxy(0, cony);
		printf("\n--------------------------------------------------------------------------\n");
		printf("준비 끝?\n");
		_sleep(1000);
		system("cls");

		break;
	}
	return choice;
}